       05  AN0233-MAP024-2.
            10 AN0233-TAB-CHIAVI2.
               15 AN0233-EL-FORMIN   OCCURS 6  PIC  X(01).
            10 AN0233-SWFORM                   PIC  X(01).
            10 AN0233-TAB-DENOM.